Revit 2015 API
ViewCropRegionShapeManager Properties
The ViewCropRegionShapeManager type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShapeSet
 Verifies that view has crop region shape set.
Split
 Verifies that view crop region is split.
Valid
 Verifies that view is allowed to manage crop region shape.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace